*** Last tax_trans_detail
    #+NAME: last_trans_tax_id
    #+BEGIN_SRC sql
      select max(id)
      from 0_trans_tax_details
    #+END_SRC

    #+RESULTS:
    | max(id) |
    |---------|
    |   39951 |

*** tax_trans_detail of the day
    #+BEGIN_SRC sql :no_web yes
          select *
          from 0_trans_tax_details
          where 
      id > 39962
      -- tran_date > '2019-02-04'
      -- order by tran_date, trans_no, id

    #+END_SRC

    #+RESULTS:
    |    id | trans_type | trans_no |  tran_date | tax_type_id | rate | ex_rate | included_in_price | net_amount | amount | memo       |
    |-------+------------+----------+------------+-------------+------+---------+-------------------+------------+--------+------------|
    | 39963 |          1 |     2219 | 2019-02-05 |           1 |   20 |       1 |                 0 |       -100 |    -20 |            |
    | 39964 |          1 |     2219 | 2019-02-05 |           1 |   20 |       1 |                 0 |        -50 |    -10 |            |
    | 39965 |          1 |     2220 | 2019-02-05 |           1 |   20 |       1 |                 0 |       -100 |    -20 | stationary |
    | 39966 |          1 |     2220 | 2019-02-05 |           1 |   20 |       1 |                 0 |        -50 |    -10 | drawing    |
    | 39967 |          1 |     2219 | 2019-02-05 |           1 |   20 |       1 |                 0 |        150 |     30 |            |
    | 39968 |          1 |     2221 | 2019-02-05 |           1 |   20 |       1 |                 0 |       -100 |    -20 | stationary |
    | 39969 |          1 |     2221 | 2019-02-05 |           1 |   20 |       1 |                 0 |        -50 |    -10 | drawing    |
    | 39970 |          1 |     2220 | 2019-02-05 |           1 |   20 |       1 |                 0 |         50 |     10 | drawing    |
    | 39971 |          1 |     2220 | 2019-02-05 |           1 |   20 |       1 |                 0 |        100 |     20 | stationary |
    | 39972 |          1 |     2221 | 2019-02-05 |           1 |   20 |       1 |                 0 |         50 |     10 | drawing    |
    | 39973 |          1 |     2221 | 2019-02-05 |           1 |   20 |       1 |                 0 |        100 |     20 | stationary |

    #+RESULTS:


    #+BEGIN_SRC  sql
	SELECT trans_type, trans_no, tran_date, tax_type_id, 0_trans_tax_details.rate, ex_rate,
            included_in_price, -SUM(net_amount) AS net_amount, -SUM(amount) AS amount, memo
		,0_tax_types.name AS tax_type_name, 
		0_trans_tax_details.rate AS effective_rate, 
		0_tax_types.rate AS rate
		FROM 0_trans_tax_details,0_tax_types
		WHERE trans_type = 1
		AND trans_no >= 2219
		AND (net_amount != 0 OR amount != 0)
		AND 0_tax_types.id = 0_trans_tax_details.tax_type_id
        GROUP BY trans_type, trans_no, tran_date, tax_type_id, 0_trans_tax_details.rate, ex_rate, included_in_price, memo
        HAVING (net_amount != 0 OR amount != 0)
    #+END_SRC

*****  ECSL query
      #+BEGIN_SRC sql
        SELECT type, d.debtor_no, d.name AS cust_name, d.tax_id, 
         SUM(CASE WHEN dt.type=11 THEN (ov_amount+ov_freight+ov_discount)*-1 
             ELSE (ov_amount+ov_freight+ov_discount) 
         END *dt.rate) AS total
                 , SUM(ttd.net_amount), sum(ttd.amount)
         FROM 0_debtor_trans dt
         LEFT JOIN 0_debtors_master d ON d.debtor_no=dt.debtor_no 
        LEFT JOIN 0_trans_tax_details ttd ON (dt.type = ttd.trans_type AND dt.trans_no = ttd.trans_no)
          WHERE dt.type IN (10,11) -- ,12)
          AND tax_id <> '' AND dt.tran_date >= '2018-10-01' AND dt.tran_date <= '2018-12-31' 
          GROUP BY debtor_no, type
           -- with rollup

      #+END_SRC

      #+RESULTS:
      | type | debtor_no | cust_name                            | tax_id        |             total | SUM(ttd.net_amount) | sum(ttd.amount) |
      |------+-----------+--------------------------------------+---------------+-------------------+---------------------+-----------------|
      |   10 |        72 | DEBCOR LTD T/A Nells Closet          | IE9771830B    |            162.41 |              142.41 |               0 |
      |   10 |       107 | Prepy&#039;s                         | IE6586514H    |               283 |                 263 |               0 |
      |   10 |       133 | Hattitude                            | IE9770194R    | 610.9499999999999 |   530.9499999999999 |               0 |
      |   10 |       213 | Annbury&#039;s                       | IE8500528C    |            960.26 |              920.26 |               0 |
      |   10 |       229 | High Society                         | IE5158135B    |             204.6 |               184.6 |               0 |
      |   10 |       253 | Jasmine Design                       | IE6322596L    |            1419.3 |              1399.3 |               0 |
      |   10 |       302 | The Forgotten Lady                   | IE8254859I    |            328.35 |              308.35 |               0 |
      |   10 |       336 | Glamorize                            | IE8953261P    |            972.06 |   932.0600000000001 |               0 |
      |   10 |       445 | Liz Collins Boutique                 | IE8742612Q    |            443.99 |              423.99 |               0 |
      |   10 |       457 | Desiree Boutique                     | IE5940553G    |            171.57 |              151.57 |               0 |
      |   11 |       519 | Moffitts of Sligo                    | IE0036695Q    |               -20 |                  20 |               0 |
      |   10 |       531 | Studia Maglia di Gimapietro Tirsa    | IT01900981000 |               562 |                 532 |               0 |
      |   10 |       574 | Active Workout Solutions Ltd Ireland | IE9762518V    |            395.78 |              375.78 |               0 |

      #+BEGIN_SRC sql
select * from 0_trans_tax_details
where  trans_type = 12 and trans_no in (8517, 8456)
#+END_SRC

#+RESULTS:
|    id | trans_type | trans_no |  tran_date | tax_type_id | rate | ex_rate | included_in_price | net_amount | amount | memo |
|-------+------------+----------+------------+-------------+------+---------+-------------------+------------+--------+------|
| 38458 |         12 |     8456 | 2018-10-09 |           1 |   20 |       1 |                 0 |      22.65 |      0 | PPD  |
| 38645 |         12 |     8517 | 2018-10-22 |           1 |   20 |       1 |                 0 |      13.95 |      0 | PPD  |

      #+END_SRC



